cmsis-svd/cmsis-svd/data/Infineon/s6e1c3xb.svd
        <!-- REGISTER "IRQ11MON" -->
        <register>
          <name>IRQ11MON</name>
          <description>IRQ11 Batch Read Register</description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ11</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ11</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ11</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ12MON" -->
        <register>
          <name>IRQ12MON</name>
          <description>IRQ12 Batch Read Register</description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ12</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ12</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ12</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ13MON" -->
        <register>
          <name>IRQ13MON</name>
          <description>IRQ13 Batch Read Register</description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ13</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ13</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ13</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ14MON" -->
        <register>
          <name>IRQ14MON</name>
          <description>IRQ14 Batch Read Register</description>
          <addressOffset>0x23C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ14</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ14</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ14</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ15MON" -->
        <register>
          <name>IRQ15MON</name>
          <description>IRQ15 Batch Read Register</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ15</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ15</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ15</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ16MON" -->
        <register>
          <name>IRQ16MON</name>
          <description>IRQ16 Batch Read Register</description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ16</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ16</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ16</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ17MON" -->
        <register>
          <name>IRQ17MON</name>
          <description>IRQ17 Batch Read Register</description>
          <addressOffset>0x248</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ17</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ17</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ17</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ18MON" -->
        <register>
          <name>IRQ18MON</name>
          <description>IRQ18 Batch Read Register</description>
          <addressOffset>0x24C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ18</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ18</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ18</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
