cmsis-svd/cmsis-svd/data/Infineon/s6e1c3xb.svd
        <!-- REGISTER "IRQ24MON" -->
        <register>
          <name>IRQ24MON</name>
          <description>IRQ24 Batch Read Register</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ24</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ24</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ24</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ25MON" -->
        <register>
          <name>IRQ25MON</name>
          <description>IRQ25 Batch Read Register</description>
          <addressOffset>0x268</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ25</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ25</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ25</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ26MON" -->
        <register>
          <name>IRQ26MON</name>
          <description>IRQ26 Batch Read Register</description>
          <addressOffset>0x26C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ26</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ26</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ26</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ27MON" -->
        <register>
          <name>IRQ27MON</name>
          <description>IRQ27 Batch Read Register</description>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ27</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ27</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ27</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ28MON" -->
        <register>
          <name>IRQ28MON</name>
          <description>IRQ28 Batch Read Register</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ28</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ28</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ28</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ29MON" -->
        <register>
          <name>IRQ29MON</name>
          <description>IRQ29 Batch Read Register</description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ29</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ29</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ29</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ30MON" -->
        <register>
          <name>IRQ30MON</name>
          <description>IRQ30 Batch Read Register</description>
          <addressOffset>0x27C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ30</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ30</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ30</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ31MON" -->
        <register>
          <name>IRQ31MON</name>
          <description>IRQ31 Batch Read Register</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "INT2" -->
            <field>
              <name>INT2</name>
              <description>Interrupt request indication from the interrupt assigned to Bit2 of IRQ31</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT1" -->
            <field>
              <name>INT1</name>
              <description>Interrupt request indication from the interrupt assigned to Bit1 of IRQ31</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "INT0" -->
            <field>
              <name>INT0</name>
              <description>Interrupt request indication from the interrupt assigned to Bit0 of IRQ31</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
